# GetCurrent Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilteredWorksetIterator..::..GetCurrent Method
FilteredWorksetIterator Class See Also
---
The current workset found by the iterator.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public Workset GetCurrent()
```

Visual Basic
---
```text
Public Function GetCurrent As Workset
```

Visual C++
---
```text
public:
Workset^ GetCurrent()
```

# ### Return Value
The workset.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | There are no more worksets in the iterator. -or- The FilteredWorksetCollector that yielded this iterator has been reset by another operation. No further iteration is permitted with this iterator. |

# See Also
FilteredWorksetIterator Class
Autodesk.Revit.DB Namespace